#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 1s [id=6135cd3232f1e0a7372b3a9c51ea95dd]
google_compute_address.static: Refreshing state... [id=projects/quansight-jlab-a11y-414k/regions/us-central1/addresses/ipv4-address]
google_compute_firewall.main: Refreshing state... [id=projects/quansight-jlab-a11y-414k/global/firewalls/http-firewall]
cloudflare_record.main: Refreshing state... [id=ce4d155d81f2844cb0bf6d6b91fe046c]
google_compute_instance.main: Refreshing state... [id=projects/quansight-jlab-a11y-414k/zones/us-central1-a/instances/jupyterlab-a11y-testing]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.main must be replaced
-/+ resource "google_compute_instance" "main" {
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/quansight-jlab-a11y-414k/zones/us-central1-a/instances/jupyterlab-a11y-testing" -> (known after apply)
      ~ instance_id             = "3839121748329425442" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "AGm6pnznc0Y=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
          + echo "requirements.txt sha256=7c20220841d70ae27f8745ed7daacdf14887774fbb6e64a06cf816f08528391c (trigger redeploy)"
            curl -L https://tljh.jupyter.org/bootstrap.py | sudo python3 - --admin costrouc --user-requirements-txt-url https://raw.githubusercontent.com/Quansight-Labs/JupyterLab-user-testing/main/requirements.txt
            sudo tljh-config set https.enabled true
            sudo tljh-config set https.letsencrypt.email costrouchov@quansight.com
            sudo tljh-config add-item https.letsencrypt.domains jupyter-a11y.quansight.dev
            sudo tljh-config reload proxy
            sudo tljh-config set user_environment.default_app jupyterlab
            sudo tljh-config reload hub
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "jupyterlab-a11y-testing"
      ~ project                 = "quansight-jlab-a11y-414k" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/quansight-jlab-a11y-414k/zones/us-central1-a/instances/jupyterlab-a11y-testing" -> (known after apply)
        tags                    = [
            "web",
        ]
      ~ tags_fingerprint        = "3d9fNIIa_10=" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/quansight-jlab-a11y-414k/zones/us-central1-a/disks/jupyterlab-a11y-testing" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20230302" -> "ubuntu-2204-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/quansight-jlab-a11y-414k/global/networks/default" -> "default"
          ~ network_ip         = "10.128.0.5" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/quansight-jlab-a11y-414k/regions/us-central1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "quansight-jlab-a11y-414k" -> (known after apply)

          ~ access_config {
              ~ network_tier = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @costrouc, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy TLJH on GCP`*